package com.example.mushroomtypeclassification;

import android.content.ContentValues;
import android.content.Context;
import android.database.Cursor;
import android.database.sqlite.SQLiteDatabase;
import android.database.sqlite.SQLiteOpenHelper;
import android.support.annotation.Nullable;

public class DatabaseHelper extends SQLiteOpenHelper {

    private static final String DATABASE_NAME = "mushroomclassify.db";
    private static final int DATABASE_VERSION = 1;

    public static final String MUSHROOM_TABLE = "mushroom_table";

    public static final String COL_ID = "_id";
    public static final String COL_THAI = "thai";
    public static final String COL_SCIENCE = "science";
    public static final String COL_IMAGE = "image";
    public static final String COL_TYPE = "type";
    public static final String COL_DETAIL = "detail";

    private static final String SQL_CREATE_TABLE_MUSHROOM
            = "CREATE TABLE " + MUSHROOM_TABLE + "("
            + COL_ID + " INTEGER PRIMARY KEY AUTOINCREMENT,"
            + COL_THAI + " TEXT,"
            + COL_SCIENCE + " TEXT,"
            + COL_IMAGE + " TEXT,"
            + COL_TYPE + " TEXT,"
            + COL_DETAIL + " TEXT"
            + ")";

    public DatabaseHelper(@Nullable Context context) {
        super(context, DATABASE_NAME, null, DATABASE_VERSION);
    }

    @Override
    public void onCreate(SQLiteDatabase db) {

        db.execSQL(SQL_CREATE_TABLE_MUSHROOM);
        ContentValues mr = new ContentValues();


        mr.put(COL_THAI, "เห็ดกรวยเกล็ดทอง");
        mr.put(COL_SCIENCE, "Gomphus floccosus");
        mr.put(COL_IMAGE, "GomphusFloccosus.jpg");
        mr.put(COL_TYPE, "poisonous");
        mr.put(COL_DETAIL,"ดอกเห็ดรูปกรวยลึก คล้ายแก้วแชมเปญ ยาวประมาณ 7-20 เซนติเมตร ขอบเป็นรอนและคลื่น ด้านในกรวยมีสีเหลือง และมีเกล็ดคล้ายปลาสีส้มเหลืองอมส้ม หรือแดงอมส้มกระจายทั่วไป ผิวด้านนอกกรวยสีเหลืองอ่อนหรือขาวนวล เป็นรอยย่นและมีสันนูนเตี้ยๆ ยาวลงไปติดก้าน ก้านยาว 5-20 เซนติเมตร รูปทรงกระบอกและเรียวลงที่โคน เนื้อเรียบ ด้านในกลวง เนื้อก้านสีขาว -1- เห็ดกรวยเกล็ดทองมีสารพิษ Gastrointestinal สารพิษชนิดนี้เป็นพิษต่อกระเพราะลำไส้ ทำให้กระเพาะลำไส้เกิดอาการระคายเคือง โดยเกิดภายใน 15 นาที ถึง 4 ชั่วโมง ผู้ที่ได้รับสารพิษจะมีอาการคลื่นไส้ อาเจียน เป็นตะคริวที่ท้อง ท้องร่วง อาจอันตรายถึงชีวิตได้หากรับประทานเห็ดกรวยเกล็ดทองในจำนวนมาก -2- เมื่อรับประทานดิบจะเป็นพิษ แต่ถ้าเห็ดกรวยเกล็ดทองถูกต้มสุกแล้วจะไม่เป็นอันตรายเพราะความร้อนทำให้พิษถูกทำลายหมดไป กลายเป็นเห็ดรับประทานได้ ");
        db.insert(MUSHROOM_TABLE, null, mr);


        mr = new ContentValues();
        mr.put(COL_THAI, "เห็ดกระดุม");
        mr.put(COL_SCIENCE, "Agaricus bisporus");
        mr.put(COL_IMAGE, "AgaricusBisporus.jpg");
        mr.put(COL_TYPE, "eat");
        mr.put(COL_DETAIL,"เห็ดกระดุมมีหมวกเห็ดสีขาว ผิวมีเกล็ดและขนบางๆ สีน้ำตาลอ่อนกระจายออกไปจากกลางหมวก หมวกเห็ดเมื่อบานเต็มที่ผิวด้านบนจะโค้งแบบระฆังคว่ำ ด้านล่างมีครีบหมวกซึ่งมีสีชมพูอ่อนปนม่วงตั้งแต่เป็นดอกอ่อนยังไม่บาน สีครีบหมวกจะเข้มข้นจนกลายเป็นสีม่วงปนน้ำตาลเมื่อเห็ดโตเต็มที่ ก้านดอกเห็ดมีรูปร่างอ้วนสั้นเป็นรูปทรงกระบอก ผิวนอกเรียบและมีสีขาวเหมือนหมวกเห็ด ตอนบนของก้านดอกมีเยื่อบางๆ เป็นวงแหวนรอบก้านดอก -1- เห็ดกระดุมมีสรรพคุณช่วยป้องกันและต้านทานต่อโรคมะเร็งต่างๆ โดยเฉพาะโรคมะเร็งเต้านมในผู้หญิง ช่วยให้ร่างกายเกิดการสร้างภูมิคุ้มกันโรคได้ดี ช่วยลดระดับคอเลสเตอรอลและไขมันในเลือดได้อย่างดีเยี่ยม และยังในการขับหรือล้างสารพิษที่สะสมอยู่ในร่างกายออกมา -2- นอกจากนี้ เห็ดกระดุมยังช่วยให้ร่างกายแข็งแรงมีพละกำลัง ช่วยทำให้ระบบขับถ่ายทำงานได้ดี ท้องไม่ผูก และช่วยทำให้ระบบเลือดภายในร่างกายไหลเวียนได้ดีขึ้น");
        db.insert(MUSHROOM_TABLE, null, mr);

        mr = new ContentValues();
        mr.put(COL_THAI, "เห็ดเกล็ดดาว");
        mr.put(COL_SCIENCE, "Amanita pantherina");
        mr.put(COL_IMAGE, "AmanitaPantherina.jpg");
        mr.put(COL_TYPE, "poisonous");
        mr.put(COL_DETAIL,"ดอกเห็ดอ่อนมีเยื่อหุ้มรูปกลมหรือรูปไข่ สีขาว ด้านบนปริแตกมีเกล็ดเล็กๆ ติดอยู่บนดอก หมวกเห็ดสีน้ำตาลอ่อนหรือน้ำตาล นูนแล้วแบนลง มีเกล็ดนูนเล็กสีขาว ขอบมีริ้ว ครีบสีขาวไม่ติดก้าน กว้าง เรียงถี่ ก้านยาวประมาณ 5-7 เซนติเมตร รูปทรงกระบอก มีวงแหวนบางขาว -1- เห็ดเกล็ดดาวมีสารพิษ Muscarine สารพิษชนิดนี้ กระตุ้นการทำงานของระบบประสาทอัตโนมัติ ทำให้ผู้ได้รับสารพิษเกิดอาการคลื่นไส้ อาเจียน ท้องเดิน ชีพจรเต้นช้า และไม่เป็นจังหวะ รูม่านตาหดแคบ หายใจไม่สะดวก เหงื่อแตก น้ำตาและน้ำลายไหล อาการจะเริ่มปรากฏหลังจากรับประทานแล้ว 15-20 นาที");
        db.insert(MUSHROOM_TABLE, null, mr);

        mr = new ContentValues();
        mr.put(COL_THAI, "เห็ดขอนสีทองเกล็ดแดง");
        mr.put(COL_SCIENCE, "Gymnopilus Aeruginosus");
        mr.put(COL_IMAGE, "GymnopilusAeruginosus.jpg");
        mr.put(COL_TYPE, "poisonous");
        mr.put(COL_DETAIL,"หมวกเห็ดสีเหลือง นูนแล้วแบน ผิวมีเกล็ดน้ำตาลแดงอมม่วงเล็กๆ หนาแน่น บางแห่งอาจมีสีเขียว ครีปสีเหลืองยาวลงไปติดกับก้าน ก้านสีเดียวกับหมวก ยาวเท่ากันตลอดก้าน มีวงแหวนสีน้ำตาลอมเหลืองอยู่เกือบปลายบยของก้าน เนื้อเห็ดมีขาวปะปนด้วยสีน้ำเงินหรือเขียว -1- เห็ดขอนสีทองเกล็ดแดงเป็นเห็ดพิษ ที่มีสารกลุ่มนี้มีอาการทางประสาทหลอนหรือฝันและมึนเมา อาจถึงขั้นวิกลจริต กล่าวกันว่ามีอาการเห็นอะไรเป็นสีเขียวหมด ต่อมา อาการจะหายเป็นปกติ แต่ก็มีรายงานว่าอาจถึงตายได้ถ้ารับประทานมาก มีฤทธิ์แบบกัญชา");
        db.insert(MUSHROOM_TABLE, null, mr);

        mr = new ContentValues();
        mr.put(COL_THAI, "เห็ดข้าวตอก");
        mr.put(COL_SCIENCE, "Termitomyces microcarpus");
        mr.put(COL_IMAGE, "TermitomycesMicrocarpus.jpg");
        mr.put(COL_TYPE, "eat");
        mr.put(COL_DETAIL,"เห็ดข้าวตอกมีหมวกเห็ดลักษณะนูนแล้วแบนและมีสีขาวนวล ขนาดเส้นผ่าศูนย์กลางประมาณ 2-3 ซ.ม มีปมนูนเล็กๆ กลางหมวกคล้ายร่ม ยอดหมวกมีสีน้ำตาลอ่อนซึ่งจะจางหายไปเมื่อดอกบานเต็มที่ ผิวเรียบ เนื้อบาง ครีบมีสีขาวนวล ไม่ยึดติดกับก้าน ก้านตรงสีขาวนวล  มักจะขึ้นตามที่โล่งดินร่วงซุย หรือใต้ต้นไม้ ที่มีใบไม้เยอะๆ อยู่รวมกันเป็นกลุ่ม พบในบริเวณที่ชื้น อุณหภูมิ 30ºC ความชื้นสัมพัทธ์ 92% หลังฝนตก มีอากาศร้อนอบอ้าว พบช่วงต้นฤดูฝน");
        db.insert(MUSHROOM_TABLE, null, mr);

        mr = new ContentValues();
        mr.put(COL_THAI, "เห็ดขี้ควาย");
        mr.put(COL_SCIENCE, "Psilocybe cubensis");
        mr.put(COL_IMAGE, "PsilocybeCubensis.jpg");
        mr.put(COL_TYPE, "poisonous");
        mr.put(COL_DETAIL,"หมวกเห็ดเมื่อบานใหม่ๆ มีลักษณะคล้ายร่ม เมื่อบานเต็มที่จะโค้งขึ้น ตรงกลางเว้าตื้น ขอบบางและมักจะฉีกขาด ผิวหมวกมีสีขาวอมเหลือง กลางหมวกสีน้ำตาลอ่อน ครีบสีน้ำตาลดำ ไม่ยึดติดกับก้าน ก้านสีขาวยาวประมาณ 5.5 - 8 เซนติเมตร รูปทรงกระบอก มีเส้นเป็นทางยาวตลอดก้าน เมื่อช้ำเป็นสีน้ำเงิน -1- ส่วนดอกเห็ดของเห็ดขี้ควายเป็นส่วนที่เป็นพิษ เห็ดขี้ควายมีสารพิษที่ทำให้เกิดอาการมึนเมาหรือประสาทหลอน คือ psilocybin ซึ่งเมื่อเข้าไปในร่างกายจะเปลี่ยนเป็น psilocin ซึ่งมีสูตรโครงสร้างคล้าย serotonin จึงไปรบกวนการทำงานของ serotonin ขนาดของสาร psilocybin ที่ทำให้เกิดอาการพิษ คือ 3.5-12 มิลลิกรัม หรือรับประทานเห็ดแห้ง 1-4 กรัม ซึ่งจะเทียบเท่ากับเห็ด 15-20 ดอก -2- ผู้ที่ได้รับสารพิษภายใน 10-30 นาที หลังจากรับประทานเห็ดเข้าไป จะมีอาการกระวนกระวาย เครียด มึนงง เวียนศีรษะ อ่อนเพลีย และมักจะหาว กล้ามเนื้อกระตุก สั่น หนาว ๆ ร้อน ๆ แขนขาเคลื่อนไหวไม่ได้ ริมฝีปากชา คลื่นไส้ โดยทั่วไปไม่อาเจียน ภายใน 30-60 นาที จะมีอาการผิดปกติของตา -3- นอกจากนั้นแล้ว ระบบการรับรู้เรื่องเวลาผิดไป มีอาการเคลิ้มฝัน และการเปลี่ยนแปลงของอารมณ์ และเปลี่ยนบุคลิก ไม่มีสมาธิ และไม่สามารถแสดงความรู้สึกได้ถูกต้อง เหงื่อแตก หาว น้ำตาไหล หน้าแดง ม่านตาขยาย หัวใจเต้นแรง ใน 1-2 ชั่วโมง ความผิดปกติของตาจะเพิ่มมากขึ้น มีอาการฝันต่าง ๆ ซึ่งอาการเหล่านี้จะหายไปใน 2-4 ชั่วโมง แต่บางรายอาการอาจจะนานถึง 6-8 ชั่วโมง อาการจะหายไปเองโดยไม่มีอาการค้าง นอกจากนี้อาจมีอาการปวดหัวหรืออ่อนเพลีย มีน้อยมากที่พบอาการซิโซฟรีเนีย ในเด็กอาการที่พบมีม่านตาขยาย ไข้สูง โคม่า และมีอาการชัก");
        db.insert(MUSHROOM_TABLE, null, mr);

        mr = new ContentValues();
        mr.put(COL_THAI, "เห็ดเข็มทอง");
        mr.put(COL_SCIENCE, "Flammulina velutipes");
        mr.put(COL_IMAGE, "FlammulinaVelutipes.jpg");
        mr.put(COL_TYPE, "eat");
        mr.put(COL_DETAIL,"เห็ดเข็มทองมีหมวกเห็ดกลมขนาดเล็ก บริเวณก้านเห็ดจะยาวเรียว มักขึ้นอยู่รวมกันเป็นกลุ่มก้อนตามซากต้นไม้ที่ตายแล้ว และจะเจริญเติบโตได้ดีมากในสภาพอากาศหนาวเย็น หรือฤดูหนาวดอกเห็ดในธรรมชาติมีสีเหลือง - ส้ม น้ำตาล - แดง หมวกเล็กลำต้นสั้น  -1- เห็ดเข็มทองมีสรรพคุณช่วยป้องกันและยับยั้งการเกิดโรคมะเร็งต่างๆ ได้ดี ช่วยให้ร่างกายแข็งแรง เกิดความสมดุลภายในร่างกายและระบบเลือดต่างๆ ช่วยให้ระบบการทำงานของตับสามารถทำงานได้เป็นปกติดี และช่วยป้องกันและรักษาโรคลำไส้อักเสบเรื้อรัง -2- และยังช่วยให้กระเพาะสามารถย่อยอาหารได้ดีขึ้น และไม่เป็นโรคกระเพาะ ช่วยกระตุ้นระบบขับถ่ายให้ทำงานได้อย่างมีประสิทธิภาพ ห่างไกลจากโรคเกี่ยวกับระบบขับถ่ายอย่างริดสีดวงทวาร เป็นต้น และยังช่วยขับสารพิษออกจากลำไส้ ที่สำคัญยังช่วยลดระดับคอเลสเตอรอลและไขมันที่สะสมอยู่ในเส้นเลือด");
        db.insert(MUSHROOM_TABLE, null, mr);

        mr = new ContentValues();
        mr.put(COL_THAI, "เห็ดไข่หงส์");
        mr.put(COL_SCIENCE, "Scleroderma citrinum");
        mr.put(COL_IMAGE, "SclerodermaCitrinum.jpg");
        mr.put(COL_TYPE, "poisonous");
        mr.put(COL_DETAIL,"ดอกเห็ดรูปกลมสีน้ำตาลอมเหลือง เส้นผ่านศูนย์กลาง 2-6 เซนติเมตร ด้านบนแบนลงเล็กน้อย ผิวแตกเป็นเกล็ดใหญ่ โคนมีเส้นใยหยาบ ๆ เป็นกระจุกยึดติดกับดิน สีขาวนวล เมื่อดอกเห็ดแก่ด้านบนมีรูเปิด ภายในมีสปอร์สีม่วงดำบรรจุอยู่เต็ม -1- เห็ดไข่หงส์เป็นเห็ดพิษ  มีสารพิษที่ทำให้เกิดอาการคลื่นไส้และอาเจียน ห้ามรับประทานทั้งดิบและสุก -2- ข้อควรระวัง : ดอกเห็ดคล้ายเห็ดหำฟานที่รับประทานได้ ต้องระมัดระวังในการเก็บ");
        db.insert(MUSHROOM_TABLE, null, mr);

        mr = new ContentValues();
        mr.put(COL_THAI, "เห็ดโคนญี่ปุ่น");
        mr.put(COL_SCIENCE, "Agrocybe aegerita");
        mr.put(COL_IMAGE, "AgrocybeAegerita.jpg");
        mr.put(COL_TYPE, "eat");
        mr.put(COL_DETAIL,"เห็ดโคนญี่ปุ่นมีดอกเห็ดสีน้ำตาลอ่อน หมวกเห็ดมีลักษณะค่อนข้างกลมมีสีครีมน้ำตาล ไปจนถึงสีน้ำตาลออกส้ม คล้ายกับหมวกเห็ดของเห็ดหอม ก้านดอกสีขาวเนื้อแน่น เกิดในท่อนไม้ผุตามธรรมชาติ -1- เห็ดโคนญี่ปุ่น มีสรรพคุณทางยาในการต้าน และป้องกันมะเร็ง ลดไขมัน และโคเลสเตอรอลในเลือด แถมยังช่วยล้างพิษที่สะสมในตับ พิษพวกอนุมูลอิสระ อัลฟาท็อกซิล และทำให้ตับแข็งแรง สามารถทำงานได้ดีขึ้น ทำให้อารมณ์ดี การสร้างเม็ดเลือดแดงดี");
        db.insert(MUSHROOM_TABLE, null, mr);

        mr = new ContentValues();
        mr.put(COL_THAI, "เห็ดจมูกหมู");
        mr.put(COL_SCIENCE, "Galiella rufa");
        mr.put(COL_IMAGE, "GaliellaRufa.jpg");
        mr.put(COL_TYPE, "eat");
        mr.put(COL_DETAIL,"เห็ดจมูกม้ารูปถ้วยก้นตื้น ภายในมีสีส้มคล้ายเยลลี่ ยืดหยุ่นได้ผิวหน้าเรียบ ผนังด้านนอกมีสีน้ำตาลดำค่อนข้างเหนียว มีขนเล็กละเอียดปกคลุมที่ปากถ้วยด้านนอก เมื่อมองจากด้านข้างมีลักษณะคล้ายกับจมูกหมู เมื่อดอกเริ่มแก่จะบานออก  คนเดินป่าในสมัยก่อนหากขาดน้ำเมื่อเจอเห็ดนี้จะตัดบริเวณที่ติดกับตอไม้ เมื่อตัดออกจะมีน้ำไหลออกมา ตัดประมาณ ๓-๔ ดอกก็จะได้น้ำประมาณหนึ่งแก้ว นอกจากนี้ยังสามารถนำมาทำอาหารได้ โดยอาจกินดิบ ลวกหรือต้ม หรือนำมายำก็อร่อย");
        db.insert(MUSHROOM_TABLE, null, mr);

        mr = new ContentValues();
        mr.put(COL_THAI, "เห็ดจาวมะพร้าว");
        mr.put(COL_SCIENCE, "Calvatia craniformis");
        mr.put(COL_IMAGE, "CalvatiaCraniformis.jpg");
        mr.put(COL_TYPE, "eat");
        mr.put(COL_DETAIL,"เห็ดจาวมะพร้าว เป็นเห็ดขนาดใหญ่ ดอกอ่อนของเห็ดจาวมะพร้าวมีลักษณะเป็นก้อนกลมสีขาว ซึ่งขยายโตขึ้นเรื่อย ๆ ตรงโคนเป็นเหมือนก้านดอก ขนาดของดอกประมาณ 5 – 12 เซนติเมตร และสูงประมาณ 4 – 10 เซนติเมตร ผิวด้านบนของดอกเห็ดอ่อนเรียบ เมื่อโตขึ้นจะค่อย ๆ เปลี่ยนเป็นผิวนูนขรุขระคล้ายผิวสมองคน และสีจะเปลี่ยนไปเป็นสีน้ำตาลอมชมพูจนเป็นสีน้ำตาลอ่อน ระยะนี้ถ้าผ่าเนื้อเห็ดจะพบว่า ดอกเห็ดมีเนื้อภายในแบ่งออกเป็น 2 ส่วน ครึ่งหนึ่งของดอกส่วนบนมีเนื้อละเอียดกว่าตอนล่าง ในระยะแรกจะมีสีขาวต่อไปจะเปลี่ยนเป็นสีเขียวหม่นอมเหลือง แล้วเปลี่ยนเป็นสีน้ำตาลอมเขียวหม่น เมื่อดอกเห็ดแก่เต็มที่เนื้อเยื่ออีกครึ่งหนึ่งที่อยู่ตอนล่าง มีลักษณะคล้ายฟองน้ำ ซึ่งหยาบกว่าส่วนบนมีสีขาวเช่นกัน ทำหน้าที่เป็นฐานของดอกเห็ดหรือก้านดอกเห็ด เมื่อเวลาดอกเห็ดแก่แล้วจะเปลี่ยนเป็นสีน้ำตาลอ่อน แตกต่างจากส่วนบน ระยะที่มีลักษณะเหี่ยวย่นคล้ายสมองคนนี้ ถ้าเอามือกดด้านบนของเห็ดจะรู้สึกอ่อนนุ่มและยืดหยุ่นกว่าระยะเป็นก้อนกลม ดอกเห็ดเมื่อแก่เต็มที่ผิวด้านบนจะแตกออก สปอร์ที่อยู่ภายในจะฟุ้งกระจายออก มาคล้ายฝุ่นสีน้ำตาลอมเขียว -1- เห็ดจาวมะพร้าวจะขึ้นตามสนามหญ้า ทุ่งนา ที่เป็นดินทรายมีอินทรีย์วัตถุบ้างเล็กน้อย น้ำไม่ท่วมขังและหน้าดินไม่เคยถูกไถมาก่อน และออกดอกชุกชุมในฤดูฝน ช่วงเดือนพฤษภาคม – กรกฎาคม ของทุกปีหลังจากมีฝนตกและอากาศร้อนอบอ้าว -2- เห็ดจาวมะพร้าวเป็นเห็ดที่บริโภคได้รสชาติดี เนื้ออ่อนนุ่มชาวบ้าน นิยมบริโภคตามธรรมชาติเห็ดตาปุ๊ช่วยย่อยอินทรีย์วัตถุเพิ่มความอุดมสมบูรณ์ของดิน");
        db.insert(MUSHROOM_TABLE, null, mr);

        mr = new ContentValues();
        mr.put(COL_THAI, "เห็ดชงโค");
        mr.put(COL_SCIENCE, "Clitocybe nuda");
        mr.put(COL_IMAGE, "ClitocybeNuda.jpg");
        mr.put(COL_TYPE, "eat");
        mr.put(COL_DETAIL,"หมวกเห็ดสีม่วง เมื่อบานเต็มที่หมวกโค้งขึ้นเล็กน้อย ขอบม้วนเข้า ผิวเรียบ สีจางลงจนเป็นสีม่วงอมชมพูอ่อน เนื้อสด เปราะ ฉ่ำน้ำเล็กน้อย ครีบสีม่วงอ่อนแล้วเปลี่ยนเป็นม่วงอมน้ำตาล ยาวขนานกับก้านเล็กน้อย มีความยาวต่างกัน 5 ขนาด ด้านที่ยึดติดกับก้านเว้าเป็นแอ่งเล็ก ๆ ก้านสีม่วงอ่อน ยาวประมาณ 5-10 เซนติเมตร ผิวมีลักษณะเป็นเส้นหยาบ ๆ สานกันแน่น โคนมีเส้นใยหยาบ ๆ เกิดเป็นกระจุก เนื้อสีขาวอมม่วงอ่อน -1- เห็ดชงโคเป็นเห็ดที่รับประทานได้ที่มีการตรวจพบการสะสมปรอท โดยเห็ดที่ตรวจพบว่ามีความเข้มข้นปรอทที่สะสมในโครงสร้างสำหรับสร้างสปอร์สูง");
        db.insert(MUSHROOM_TABLE, null, mr);

        mr = new ContentValues();
        mr.put(COL_THAI, "เห็ดชิเมจิ");
        mr.put(COL_SCIENCE, "Hypsizygus marmoreus");
        mr.put(COL_IMAGE, "HypsizygusMarmoreus.jpg");
        mr.put(COL_TYPE, "eat");
        mr.put(COL_DETAIL,"เห็ดชิเมจิขาวหรือเห็ดชิเมะจิขาวนั้นจะเป็นดอกเล็กๆ เติบโตแบบเป็นกระจุกสีขาว โดยบริเวณหมวกเห็ดนั้นจะมีลายคล้ายหินอ่อนอยู่ หรืออาจเป็นรอยจุดน้ำก็ได้ แต่หากอยู่ในภาวะที่อุณหภูมิมีความชื้นสูงตลอดเวลาก็จะทำให้รอยเหล่านี้จะไม่ปรากฏขึ้นที่หมวกเห็ด และเป็นเห็ดที่ชื่นชอบเป็นพิเศษกับอากาศเย็นซึ่งจะทำให้เห็ดชนิดนี้สามารถเจริญเติบโตได้ดี -1- เห็ดชิเมจิมีสรรพคุณที่ช่วยป้องกันโรคมะเร็งได้ดีมากๆ และช่วยยับยั้งไม่ให้เซลล์มะเร็งเจริญเติบโตขึ้น ช่วยลดระดับน้ำตาลและปริมาณของไขมันที่อุดตันอยู่ในเส้นเลือด และช่วยให้ตับของเราไม่ต้องทำงานหนักมาก -2- นอกจากนี้แล้วยังช่วยล้างและขับสารพิษที่ตกค้างอยู่ในตับออกมา ช่วยในเรื่องของการควบคุมน้ำหนักได้ดี เพราะไม่มีไขมันที่ทำให้อ้วน และมีโซเดียมในปริมาณที่ต่ำมากๆ ทำให้ไม่เกิดภาวะตัวบวม และยังมีอนุมูลอิสระที่ช่วยให้ร่างกายแข็งแรงไม่เจ็บป่วยบ่อย แถมเห็ดชิเมจิยังช่วยป้องกันโรคโลหิตจาง");
        db.insert(MUSHROOM_TABLE, null, mr);

        mr = new ContentValues();
        mr.put(COL_THAI, "เห็ดปะการังเข็มเหลือง");
        mr.put(COL_SCIENCE, "Clavulinopsis fusiformis");
        mr.put(COL_IMAGE, "ClavulinopsisFusiformis.jpg");
        mr.put(COL_TYPE, "eat");
        mr.put(COL_DETAIL,"ดอกเห็ดไม่มีหมวก แต่มีลักษณะเป็นเส้นยาว รูปใบหอกแบนหรือรูปทรงกระบอก สีเหลืองสดหรือเหลืองอมส้ม ยาวประมาณ 5-15 เซนติเมตร  มีร่องยาวคล้ายซังขนุน ภายในเป็นรูกลวง ผิวเรียบ บางดอกโคนติดกันหรือแตกแขนง ปลายแหลมหรือแยกเป็น 2 แฉก เนื้อในเห็ดสีเหลือง");
        db.insert(MUSHROOM_TABLE, null, mr);

        mr = new ContentValues();
        mr.put(COL_THAI, "เห็ดแดงน้ำหมาก");
        mr.put(COL_SCIENCE, "Russula emetica");
        mr.put(COL_IMAGE, "RussulaEmetica.jpg");
        mr.put(COL_TYPE, "poisonous");
        mr.put(COL_DETAIL,"หมวกเห็ดรูปกระทะคว่ำ มีสีแดงสด กลางหมวกเป็นแอ่งเล็กน้อยสีแดงเรื่อๆ ผิวหมวกเรียบ หนืดมือ ขอบหมวกงอลง ครีบสีขาวหรือขาวนวลเรียงห่างกันเล็กน้อย ไม่ยึดติดกับก้าน ก้านสีขาว ยาวประมาณ 5-10 เซนติเมตร มักมีรอยย่นยาว เนื้อแน่นขาว -1- เห็ดแดงน้ำหมากมีสารพิษ Gastrointestinal สารพิษชนิดนี้ทำให้มีอาการคลื่นไส้ อาเจียน และท้องร่วง อาจถึงแก่เสียชีวิตได้หากรับประทานในจำนวนมาก เมื่อรับประทานแบบดิบจะเป็นพิษ แต่สามารถรับประทานได้ถ้าต้มสุกแล้ว เพราะความร้อนทำลายพิษให้หมดไป");
        db.insert(MUSHROOM_TABLE, null, mr);

        mr = new ContentValues();
        mr.put(COL_THAI, "เห็ดแครง หรือเห็ดตีนตุ๊กแก");
        mr.put(COL_SCIENCE, "Schizophyllum commune");
        mr.put(COL_IMAGE, "SchizophyllumCommune.jpg");
        mr.put(COL_TYPE, "eat");
        mr.put(COL_DETAIL,"ดอกเห็ดเจริญออกข้างเดียวคล้ายพัดกว้าง ด้านบนสีขาวหม่นมีขนละเอียดสีเดียวกัน ด้านล่างสีน้ำตาลหรือน้ำตาลอมแดง ลักษณะคลบ้ายครีบแต่แคบเรียวเล็กแยกเป็นแฉก รัศมีจากโคนดอกไปจดขอบหมวก เมื่อแห้งขอบจะม้วนงอลง มีรอยฉีกเป็นทางยาวเข้าไปเกือบถึงโคนดอกเป็นบางแห่ง ทำให้มองดูคล้ายตีนตุ๊กแกหรือแครงรดน้ำ -1- เห็ดแครงเป็นเห็ดที่มีแร่ธาตุอาหารต่างๆ เป็นอาหารบำรุงร่างกายทำให้สุขภาพดี อีกทั้งมีสาร Schizophyllan ที่มีสรรพคุณในด้านการรักษาโรคต่างๆมากมาย เห็ดแครงสามารถปรุงอาหารได้หลายชนิด เช่น นำมาเจียวกับไข่ แกงกะทิ ห่อหมก งบเห็ดแครง ในประเทศจีนมีการแนะนำให้คนไข้ที่เป็นโรคระดูขาว รับประทานเห็ดแครงที่ปรุงกับไข่เพื่อรักษาโรค และรับประทานร่วมกับใบชาโดยต้มเห็ดแครง 9 – 16 กรัม กับน้ำกินวันละประมาณ 3 ครั้ง ใช้เป็นอาหารบำรุงร่างกาย ในประเทศญี่ปุ่นใช้เป็นยาเนื่องจาก พบสารประกอบพวก polysaccharide ชื่อว่า Schizophyllan (1,3 B-glucan) ซึ่งมีคุณสมบัติในการต่อต้านเชื้อไวรัสและยับยั้งเซลมะเร็งชนิด Sarcoma 180 และ Sarcoma 37");
        db.insert(MUSHROOM_TABLE, null, mr);

        mr = new ContentValues();
        mr.put(COL_THAI, "เห็ดถั่งเช่า");
        mr.put(COL_SCIENCE, "Ophiocordyceps sinensis");
        mr.put(COL_IMAGE, "OphiocordycepsSinensis.jpg");
        mr.put(COL_TYPE, "eat");
        mr.put(COL_DETAIL,"มีลักษณะเหมือนตัวหนอนตัวเล็กๆ และมีต้นเห็ดหรือหญ้าขึ้นอยู่บนหัว -1- สรรพคุณของเห็ดถั่งเช่า ไม่ว่าจะเป็นถั่งเช่าทิเบตแท้ หรือถั่งเช่าสีทองที่มีอยู่มากมาย คือช่วยบำรุงร่างกาย บำรุงกำลัง เพิ่มภูมิต้านทานโรคทำให้ร่างกายสดชื่น ช่วยแก้อาการอ่อนเพลีย ช่วยต่อต้านอนุมูลอิสระในร่างกาย ชะลอความแก่ชราและความเสื่อมของเซลล์ต่างๆในร่างกาย ช่วยลดความดันโลหิตสูง ลดระดับน้ำตาลในเลือด ลดระดับคลอเรสเตอรอล และรักษาสมดุลของคลอเรสเตอรอลในหลอดเลือด -2- ช่วยในด้านอารมณ์ ระงับประสาท ทำให้จิตใจสงบผ่อนคลาย ช่วยเพิ่มความจำ ป้องกันโรคความจำเสื่อมในผู้สูงอายุ และจากงานวิจัยพบว่าถั่งเช่าช่วยให้ผู้ป่วยไตวายเรื้อรังมีอาการดีขึ้นมากถึง 51% หลังจากบริโภคถั่งเช่า 1 เดือน นอกจากนี้สรรพคุณที่เป็นที่สนใจกันมากก็คือบำรุงและเสริมสมรรถภาพทางเพศ ซึ่งได้มีรายงานวิจัยจากต่างประเทศในสัตว์ทดลองและมนุษย์มาแล้ว จึงทำให้มีผู้สนใจเป็นอย่างมากจากกลุ่มที่เป็นผู้รักสุขภาพ");
        db.insert(MUSHROOM_TABLE, null, mr);

        mr = new ContentValues();
        mr.put(COL_THAI, "เห็ดถ่านเล็ก");
        mr.put(COL_SCIENCE, "Russula densifolia");
        mr.put(COL_IMAGE, "RussulaDensifolia.jpg");
        mr.put(COL_TYPE, "eat");
        mr.put(COL_DETAIL,"หมวกเห็ดสีขาวนวล กลางหมวกเว้าตื้น ผิวเรียบและหนืดมือเมื่อจับ แต่จะค่อย ๆ แห้งไป เนื้อบางสีขาว ครีบสีขาวนวล บาง และแคบ ยึดติดกับก้านและเรียงชิดกัน ก้านสีขาวนวล ยาวประมาณ 1-2 เซนติเมตร ภายในสีขาว สีดอกเห็ดจะค่อย ๆ เปลี่ยนเป็นสีน้ำตาลดำและสีดำ -1- เห็ดถ่านเล็กเป็นเห็ดที่สามารถกินได้พบได้ในทั่วโลก และมีเขตการกระจายพันธุ์ในประเทศไทยทางภาคเหนือ และภาคตะวันออกเฉียงเหนือ จะขึ้นเป็นดอกเดี่ยว และกลุ่มในป่าก่อ ป่าตองตึง และป่าสน นอกจากนั้นน้ำต้มเห็ดจะออกเป็นสีด้าเมื่อชิมสดๆแล้วร้อนเผ็ด");
        db.insert(MUSHROOM_TABLE, null, mr);

        mr = new ContentValues();
        mr.put(COL_THAI, "เห็ดถ่านใหญ่");
        mr.put(COL_SCIENCE, "Russula nigricans");
        mr.put(COL_IMAGE, "RussulaNigricans.jpg");
        mr.put(COL_TYPE, "eat");
        mr.put(COL_DETAIL,"หมวกเห็ดรูปกระทะคว่ำ สีขาวหม่น ผิวเรียบ กลางหมวกเว้าตื้น เนื้อหนา ครีบใหญ่สีขาวนวล ยึดติดกับก้าน เรียงห่างกันและมีครีบสั้นสลับ เมื่อดอกแก่โค้งงอขึ้น ก้านสีขาว เมื่อดอกแก่ทั้งดอกเปลี่ยนเป็นสีน้ำตาลและดำ -1- เห็ดถ่านใหญ่พบในป่า ทางภาคเหนือและภาคตะวันออกเฉียงเหนือของประเทศไทย ชอบขึ้นบนพื้นดินในป่าละเมาะที่เป็นดินลูกรัง ดินร่วน และหน้าดินเป็นธรรมชาติไม่เคยถูกทำลายมาก่อน เห็ดถ่านใหญ่เกิดเป็นดอกเดี่ยวอิสระและอยู่กระจัดกระจายไม่ชุกชุมเหมือนเห็ดอื่น ๆ  เห็ดถ่านใหญ่พบได้ในฤดูฝนเดือนพฤษภาคม – กันยายน จะพบในช่วงที่มีความชื้นสูงอากาศร้อนอบอ้าว -2- เห็ดถ่านใหญ่เป็นเห็ดที่รับประทานได้ รสชาติดีเป็นที่ดีเป็นที่นิยมบริโภคของชาวบ้านและขายได้ราคาแพง");
        db.insert(MUSHROOM_TABLE, null, mr);

        mr = new ContentValues();
        mr.put(COL_THAI, "เห็ดนางฟ้า");
        mr.put(COL_SCIENCE, "Pleurotus pulmonarius");
        mr.put(COL_IMAGE, "PleurotusPulmonarius.jpg");
        mr.put(COL_TYPE, "eat");
        mr.put(COL_DETAIL,"เห็ดนางฟ้ามักจะพบตามธรรมชาติบริเวณตอไม้เนื้ออ่อนที่กำลังผุ ในแถบเมืองแจมมู บริเวณเชิงเขาหิมาลัย มีรูปร่างลักษณะคล้ายคลึงกับเห็ดนางรม และเห็ดเป๋าฮื้อ แต่จะมีสีอ่อนกว่า และมีครีบอยู่ชิดกันมากกว่า ด้านบนของดอกจะมีสีนวลๆ ถึงสีน้ำตาลอ่อน ดอกเห็ดนางฟ้าจะมีขนาดตั้งแต่ 5-14 เซ็นติเมตร และจะมีน้ำหนักอยู่ระหว่าง 30-120 กรัม -1- เห็ดนางฟ้ามีสรรพคุณเด่นคือช่วยในการไหลเวียนของเลือด สามารถบรรเทาและป้องกันโรคหวัด หากกินเป็นประจำจะทำให้ระบบภูมิคุ้มกันสมบูรณ์แข็งแรงส่งผลให้การติดเชื้อต่างๆ ลดลง รักษาโรคเลือดออกตามไรฟันหรือโรคในช่องปาก นอกจากนี้ช่วยลดโอกาสการเกิดโรคมะเร็งและลดไขมันในเลือดได้เป็นอย่างดี -2- เห็ดนางฟ้ามีสารอาหารอย่างโปรตีนสูงกว่าเนื้อสัตว์ จึงมีคุณสมบัติในการช่วยซ่อมแซมส่วนที่สึกหรอต่างๆ ของร่างกาย แถมยังมีรสชาติคล้ายเนื้อสัตว์และไม่เหนียวด้วย ทำให้เป็นผลดีต่อระบบย่อยอาหารไม่ต้องทำงานหนัก -3- เห็ดนางฟ้ายังเป็นแหล่งรวมของวิตามินและกรดอะมิโนที่จำเป็นหลายชนิด โดยเฉพาะวิตามินรวมหรือไรโบฟลาวินและไนอาซิน ซึ่งมีหน้าที่สำคัญในการควบคุมการทำงานของระบบย่อยอาหาร ป้องกันและรักษาโรคกระเพาะอาหาร");
        db.insert(MUSHROOM_TABLE, null, mr);

        mr = new ContentValues();
        mr.put(COL_THAI, "เห็ดนางรมทอง");
        mr.put(COL_SCIENCE, "Pleurotus citrinopileatus");
        mr.put(COL_IMAGE, "PleurotusCitrinopileatus.jpg");
        mr.put(COL_TYPE, "eat");
        mr.put(COL_DETAIL,"มีรูปร่างเหมือนหรือคล้ายกับหอยนางรม มีดอกเห็ดเป็นสีเหลืองทองอร่ามดูสีสันสวยงามน่ารับประทาน โดยบริเวณหมวกดอกของเห็ดนางรมทองนั้นจะมีผิวเรียบ ส่วนตรงกลางจะเว้าเป็นแอ่ง ซึ่งขอบหมวกจะเอียงลงเล็กน้อย และใต้หมวกจะเป็นครีบเมื่อดอกเห็ดบานเต็มที่แล้ว ส่วนบริเวณก้านดอกนั้นจะติดกับหมวกดอกเห็ดเป็นเนื้อเดียวกัน โดยดอกเห็ดนี้อาจขึ้นเป็นดอกเดี่ยวๆ เลย หรือจะขึ้นเป็นกระจุกกันอยู่ก็ได้ ซึ่งดอกเห็ดนี้จะมีลักษณะดูบอบบาง และหมวกเห็ดนี้จะขึ้นซ้อนกันอยู่เป็นชั้นๆ เป็นเห็ดที่เจริญเติบโตได้ดีในอากาศเย็น จึงมักมีการทำการเพาะปลูกในช่วงฤดูฝนและฤดูหนาว -1- เห็ดนางรมทองมีกรดโฟลิกอยู่สูงช่วยรักษาและป้องกันโรคธาลัสซีเมีย (โลหิตจาง) ช่วยขับไขมันไม่ดีออก ทำให้ไม่ไปอุดตันตามเส้นเลือด ช่วยแก้และป้องกันโรคเบาหวาน ช่วยลดและป้องกันโรคความดันโลหิตสูง และมีไขมันต่ำและปริมาณโซเดียมน้อยเหมาะกับคนที่กำลังลดน้ำหนัก อีกทั้งป้องกันโรคหัวใจ ช่วยบำรุงการทำงานของระบบหัวใจให้เป็นปกติ ป้องกันโรคไตอักเสบ ช่วยให้ไตสามารถทำงานได้เป็นปกติ และช่วยบำรุงร่างกายให้แข็งแรง ไม่เจ็บป่วยง่าย");
        db.insert(MUSHROOM_TABLE, null, mr);

        //////////////////////////////////////////////////////////////////
        //////////////////////////////////////////////////////////////////
        //////////////////////////////////////////////////////////////////
        mr = new ContentValues();
        mr.put(COL_THAI, "เห็ดน้ำหมึก");
        mr.put(COL_SCIENCE, "Coprinus cinerea");
        mr.put(COL_IMAGE, "CoprinopsisCinerea.JPG");
        mr.put(COL_TYPE, "eat");
        mr.put(COL_DETAIL,"หมวกเห็ดรูประฆังหรือรูปกรวยคว่ำ สีเทา กลางหมวกสีน้ำตาลอ่อน มีขนและเกล็ดสีเทาหรือสีน้ำตาลอ่อนหลุดง่าย ขอบเป็นริ้วและม้วนงอขึ้นเมื่อดอกแก่ ครีบสีน้ำตาลดำ แคบเรียงชิดติดกัน ไม่ยึดติดกับก้าน ต่อมาเปลี่ยนเป็นสีดำแล้วสลายเป็นหยดน้ำสีดำ ก้านยาวประมาณ 3-12 เซนติเมตร รูปทรงกระบอก สีขาว โคนก้านโปร่งเล็กน้อยและมีรากยาว ตรงกลางก้านกลวง ผิวมีขนบางๆ");
        db.insert(MUSHROOM_TABLE, null, mr);

        mr = new ContentValues();
        mr.put(COL_THAI, "เห็ดเนยแม่มด");
        mr.put(COL_SCIENCE, "Tremella mesenterica");
        mr.put(COL_IMAGE, "TremellaMesenterica.jpg");
        mr.put(COL_TYPE, "eat");
        mr.put(COL_DETAIL,"ยลักษณะเป็นวุ้นสีเหลืองส้มซึ่งสามารถเจริญเติบโตได้สูงถึง 7.5 ซม. (3.0 นิ้ว) มีพื้นผิวที่ซับซ้อนหรือห้อยเป็นตุ้มซึ่งมันเยิ้มหรือลื่นไหลเมื่อชื้น มันเติบโตในรอยแยกในเปลือกไม้ปรากฏขึ้นในช่วงที่ฝนตก ภายในไม่กี่วันหลังจากฝนตกมันจะแห้งเป็นแผ่นฟิล์มบาง ๆ หรือมวลที่เหี่ยวเฉาซึ่งสามารถฟื้นฟูหลังจากฝนตกในเวลาต่อมา");
        db.insert(MUSHROOM_TABLE, null, mr);

        mr = new ContentValues();
        mr.put(COL_THAI, "เห็ดปอดดำ");
        mr.put(COL_SCIENCE, "Strobilomyces floccopus");
        mr.put(COL_IMAGE, "StrobilomycesFloccopus.jpg");
        mr.put(COL_TYPE, "eat");
        mr.put(COL_DETAIL,"หมวกเห็ดรูปกระทะคว่ำ ดอกที่บานไม่เต็มที่ผิวหมวกคล้ายผลน้อยหน่า หมวกมีสีเทาแล้วเปลี่ยนเป็นสีดำ มีขนรวมกันเป็นกลุ่มสี่เหลี่ยมคล้ายเกล็ดสีเทาดำแนบติดกับหมวก เกล็ดที่อยู่กลางหมวกงอขึ้นเล็กน้อย ขอบหมวกมีเศษของวงแหวนที่ขาดจากก้านห้อยติดอยู่โดยรอบ ก้านมีสีเดียวกับหมวก ยาว 6-8 เซนติเมตร มีวงแหวนเป็นชิ้นเล็ก ๆ ตัดแล้วเปลี่ยนเป็นสีแดงแล้วเปลี่ยนเป็นน้ำตาลดำ");
        db.insert(MUSHROOM_TABLE, null, mr);

        mr = new ContentValues();
        mr.put(COL_THAI, "เห็ดปะการังพวงแสด");
        mr.put(COL_SCIENCE, "Clavulinopsis miyabeana");
        mr.put(COL_IMAGE, "ClavulinopsisMiyabeana.jpg");
        mr.put(COL_TYPE, "eat");
        mr.put(COL_DETAIL,"ดอกกว้าง 0.3-1 เซนติเมตร สูง5-10 เซนติเมตร แท่งเรียวยาว และบิดงอเล็กน้อย ปลายแหลมสีแดงอมส้ม ไม่มีก้าน ลักษณะโดยรวมคล้ายกับปะการัง");
        db.insert(MUSHROOM_TABLE, null, mr);

        mr = new ContentValues();
        mr.put(COL_THAI, "เห็ดปะการังส้มอมชมพู");
        mr.put(COL_SCIENCE, "Ramaria formosa");
        mr.put(COL_IMAGE, "RamariaFormosa.jpg");
        mr.put(COL_TYPE, "poisonous");
        mr.put(COL_DETAIL,"ดอกเห็ดรูปปะการัง ตอนบนแตกแขนงมากมายเป็นพุ่มใหญ่ สีเหลืองหม่นอมชมพู ปลายแขนงสีเหลืองอ่อน เมื่อช้ำจะเปลี่ยนเป็นสีน้ำตาลแดง ก้านใหญ่ สีขาว โคนสอบมีขนละเอียดสีขาว");
        db.insert(MUSHROOM_TABLE, null, mr);

        mr = new ContentValues();
        mr.put(COL_THAI, "เห็ดปุยฝ้าย");
        mr.put(COL_SCIENCE, "Hericium erinaceus");
        mr.put(COL_IMAGE, "HericiumErinaceus.jpg");
        mr.put(COL_TYPE, "eat");
        mr.put(COL_DETAIL,"เป็นเห็ดที่มีขนาดใหญ่ ดอกเห็ดมีรูหลายรู เป็นทรงกลมมีเส้นสีขาวฟู โดยดอกเห็ดอ่อนจะมีสีขาวแต่ไม่มีขน เมื่อแก่ขึ้นจะเปลี่ยนเป็นสีน้ำตาลอ่อนและแตกเป็นขนฝอยๆ ห้อยลงมาคล้ายกับหัวลิง");
        db.insert(MUSHROOM_TABLE, null, mr);

        mr = new ContentValues();
        mr.put(COL_THAI, "เห็ดเป๋าฮื้อ");
        mr.put(COL_SCIENCE, "Pleurotus ostreatus");
        mr.put(COL_IMAGE, "PleurotusOstreatus.JPG");
        mr.put(COL_TYPE, "eat");
        mr.put(COL_DETAIL,"หมวกเห็ดรูปพัด สีน้ำตาลดำหรือสีเทา เนื้อหนา กลางหมวกเว้าตื้น มีขนกำมะหยี่สีน้ำตาลดำบาง ๆ ซึ่งจะหลุดหายไปเมื่อดอกแก่ คงเหลืออยู่บ้างบริเวณกลางหมวกโดยรวมกันเหมือนเกล็ดเล็ก ๆ ขอบเรียบ สีน้ำตาลดำ เนื้อเห็ดสดสีขาว แต่จะเหนียวเมื่อดอกแก่ ครีบสีขาวนวล ขนานกันตามยาว มีหลายชนาดและบางอันเชื่อมติดกันเป็นตอน ก้านสีเทาดำ ยาวประมาณ 4-6 เซนติเมตร ก้านจะไม่อยู่กึ่งกลางดอก ด้านหนึ่งอยู่ติดขอบหมวกทำให้ดูเหมือนเป็นด้ามพัด โคนก้านสอบเล็ก -1- เห็ดเป๋าฮื้อมีสรรพคุณช่วยกระตุ้นระบบภูมิคุ้มกัน มีส่วนช่วยลดระดับน้ำตาลในเลือด มีส่วนช่วยปรับสภาพความดันโลหิต อีกทั้งช่วยป้องกันโรคมะเร็ง ช่วยยับยั้งการเจริญเติบโตของเนื้อร้าย ช่วยต่อต้านเชื้อแบคทีเรียพวกกรัมบวก ช่วยป้องกันโรคหวัด และยังช่วยเพิ่มการไหลเวียนของโลหิต ช่วยรักษาโรคกระเพาะ ช่วยป้องกันโรคท้องผูก และมีส่วนช่วยลดการอักเสบ");
        db.insert(MUSHROOM_TABLE, null, mr);

        mr = new ContentValues();
        mr.put(COL_THAI, "เห็ดเผาะ");
        mr.put(COL_SCIENCE, "Astraeus hygrometricus");
        mr.put(COL_IMAGE, "AstraeusHygrometricus.jpg");
        mr.put(COL_TYPE, "eat");
        mr.put(COL_DETAIL,"มีลักษระกลม มีเส้นผ่านศูนย์กลางขนาด1-3เซนติเมตร ไม่มีก้านดอก ดอกเห็ดอ่อนสีน้ำตาลอ่อน เมื่อแก่จะมีสีน้ำตาลเข้มถึงดำ ผนังดอกแบ่งเป็นชั้น 2 ชั้น ที่สำคัญคือเห็ดเผาะเป็นเห็ดที่เกิดในต้นฤดูฝน ชอบอากาศชื้น และเมื่อเก็บเห็ดไปแล้วมันจะขึ้นใหม่ที่ต้นเดิมทุกปี เห็ดเผาะพบมากในภาคเหนือและภาคตะวันออกเฉียงเหนือของประเทศไทย -1- สรรพคุณของเห็ดเผาะ คือ มีสารที่มีฤทธิ์ต้านเชื้อแบคทีเรีย และสารพิษ ช่วยยับยั้งเนื้อร้าย ต้านเซลล์มะเร็ง เห็ดเผาะเป็นยากระตุ้นการหลั่งเอ็นไซม์ ช่วยให้ร่างกายหลั่งอินซูลินได้อย่างมีประสิทธิภาพ อีกทั้งเป็นยารักษาโรคเบาหวาน ช่วยฟื้นฟูแผลเปื่อยจากโรคเบาหวาน และช่วยบรรเทาอาการคันผิวหนัง และคันตามนิ้วมือ นิ้วเท้า เห็ดเผาะมีวิตามินซี และเกลือแร่ ช่วยให้พลังงานและช่วยบำรุงผิวให้สดใส มีสารที่ช่วยบำรุงผิว ช่วยสมานแผล และทำให้ผิวเนียนเรียบ เห็ดเผาะเป็นยาอายุวัฒนะ ช่วยบำรุงเซลล์ต่างๆ ภายในร่างกาย");
        db.insert(MUSHROOM_TABLE, null, mr);

        mr = new ContentValues();
        mr.put(COL_THAI, "เห็ดพายทอง");
        mr.put(COL_SCIENCE, "Dacryopinax spathularia");
        mr.put(COL_IMAGE, "DacryopinaxSpathularia.jpg");
        mr.put(COL_TYPE, "eat");
        mr.put(COL_DETAIL,"ดอกเห็ดรูปร่างคล้ายใบพาย ปลายมนหรือหยักเป็นคลื่นเล็กน้อย สีเหลืองเข้มหรือเหลืองทอง เนื้อแข็งและใสเหมือนวุ้น ก้านสีน้ำตาลอ่อนอมเหลืองหรือสีส้ม รูปทรงกระบอก ยาวประมาณ 0.5 - 1 เซนติเมตร -1- เห็ดพายทองเป็นเห็ดไม่มีพิษ สามารถรับประทานได้ แต่ไม่นิยมนำมาประกอบอาหารเนื่องจากมีขนาดเล็ก");
        db.insert(MUSHROOM_TABLE, null, mr);

        mr = new ContentValues();
        mr.put(COL_THAI, "เห็ดพุงหมู");
        mr.put(COL_SCIENCE, "Russula foetens");
        mr.put(COL_IMAGE, "RussulaFoetens.JPG");
        mr.put(COL_TYPE, "poisonous");
        mr.put(COL_DETAIL,"หมวกเห็ดรูปกลม สีน้ำตาลอมเหลือง เมื่อบานหมวกจะค่อย ๆ กางออกทำให้กลางหมวกเว้าตื้น เนื้อหมวกหนา ผิวเป็นเมือกเมื่อเปียกน้ำ ขอบเป็นริ้วโดยรอบ ครีบสีขาวนวล ยึดติดกับก้านและเรียงห่างกัน ก้านรูปทรงกระบอก สีขาวนวลหรือน้ำตาลอ่อนอมเหลือง ยาวประมาณ 4-8 เซนติเมตร เนื้อในเห็ดสีขาว บางส่วนเป็นโพรงเล็ก ๆ");
        db.insert(MUSHROOM_TABLE, null, mr);

        mr = new ContentValues();
        mr.put(COL_THAI, "เห็ดฟานน้ำตาลแดง");
        mr.put(COL_SCIENCE, "Lactarius volemus");
        mr.put(COL_IMAGE, "LactariusVolemus.jpg");
        mr.put(COL_TYPE, "eat");
        mr.put(COL_DETAIL,"ดอกนูน กลางหมวกมีแอ่งเล็กน้อย สีน้ำตาลส้ม ขนาดเส้นผ่าศูนย์กลาง 5-10 เซนติเมตร ลักษณะแห้งและมีขนคล้ายกำมะหยี่ขอบม้วนเล็กน้อย ครีบมีสีขาวนวล บางแคบ เรียงชิดกันยิดติดกับก้านรูปทรงกระบอก สีน้ำตาลอมเหลือง ยาว 3-10 เซนติเมตร เส้นผ่านศูนย์กลางอยู่ที่ 1-2 เซนติเมตร มีขนคล้ายกำมะหยี่เช่นเดียวกับดอก เมื่อฉีกจะมียางสีขาวออกมา ");
        db.insert(MUSHROOM_TABLE, null, mr);

        mr = new ContentValues();
        mr.put(COL_THAI, "เห็ดเฟืองล้อสีส้ม");
        mr.put(COL_SCIENCE, "Marasmius siccus");
        mr.put(COL_IMAGE, "MarasmiusSiccus.jpg");
        mr.put(COL_TYPE, "eat");
        mr.put(COL_DETAIL,"หมวก รูประฆังคว่ำ เมื่อเจริญขึ้นหมวกจะบานออก กลางหมวกเป็นแอ่งเล็กน้อย ผิวแห้งมีลอยหยักลึก มีขนอ่อนบางๆสีน้ำตาลแดง ครีบเรียงห่าง สีขาว ก้านมีความยาว 2-6 เซนติเมตร ทรวงกระบอกกรวง ลักษณะแห้ง เรียบ ยาว โคนสีน้ำตาล เมื่อดอกแก่จะเปลี่ยนสีเป็นสีน้ำตาลเข้มและมันเงา  ");
        db.insert(MUSHROOM_TABLE, null, mr);

        mr = new ContentValues();
        mr.put(COL_THAI, "เห็ดมิลค์กี้");
        mr.put(COL_SCIENCE, "Calocybe Indica");
        mr.put(COL_IMAGE, "CalocybeIndica.jpg");
        mr.put(COL_TYPE, "eat");
        mr.put(COL_DETAIL,"ลักษณะของเห็ดมิลค์กี้ คือ ดอกจะเป็นสีขาวนวล เหมือนน้ำนม ดอกมีขนาดใหญ่สุดมากถึง 7 ขีด เป็นเห็ดที่ชอบอากาศร้อนชื้น ที่อุณหภูมิ 36 องศาเซลเซียล เป็นเห็ดที่ได้รับความนิยมในกลุ่มผู้บริโภค เนื่องจาก รสชาติของดอกเหมือนเนื้อไก่ ส่วนก้านดอกเหมือนปลาหมึก และเมื่อนำมาทำอาหาร รสชาติของเห็ดจะคงสภาพเดิม แม้ทำทิ้งไว้นานถึง 3 วัน หรืออุ่นหลายรอบ เห็ดยังคงสภาพเหมือนตอนปรุงเสร็จใหม่ๆ");
        db.insert(MUSHROOM_TABLE, null, mr);

        mr = new ContentValues();
        mr.put(COL_THAI, "เห็ดไมตาเกะ");
        mr.put(COL_SCIENCE, "Grifola frondosa");
        mr.put(COL_IMAGE, "GrifolaFrondosa.jpg");
        mr.put(COL_TYPE, "eat");
        mr.put(COL_DETAIL,"“เห็ดไมตาเกะเป็นพืชที่มีสรรพคุณทางยา มีลักษณะเด่น คือ เป็นเห็ดที่มีขนาดใหญ่ ทำให้ได้รับฉายาขนานนามว่า “ราชาแห่งเห็ด” หรือ King of Mushroom ดอกเห็ดจะมีลักษณะโค้ง สีน้ำตาลแกมเทา มีเส้นผ่านศูนย์กลาง 60 เซนติเมตร -1- เห็ดไมตาเกะนั้นมีสารที่เรียกว่า Polysaccharide และ Beta Glucan มีมากกว่าเห็ดชนิดอื่นช่วยในกระบวนการ   สร้างเสริม และกระตุ้นภูมิคุ้มกันของร่างกายให้มีความพร้อมที่จะต่อสู้กับเชื้อโรคต่างๆ และสารสกัดที่ได้จากเห็ดไมตาเกะออกฤทธิ์ต้านการสร้างหลอดเลือดใหม่ หรือต้านเจริญผิดปกติของเส้นเลือดฝอย (Anti Angiogenic) เปรียบเสมือนกับเป็นสารต้านอนุมูลอิสระ (Antioxidant) สามารถยับยั้งหรือชะลอการเกิดปฏิกิริยาออกซิเดชัน (oxidation) ซึ่งเป็นสาเหตุของการเกิดอนุมูลอิสระ (free radical) ทำให้ลดความเสี่ยงของการเกิดเส้นเลือดขอด และลดการเจริญของมะเร็งบางชนิด -2- เห็ดไมตาเกะสดในปริมาณ 100 กรัม มีไฟเบอร์ปริมาณ 3.5 กรัม เห็ดไมตาเกะสดในปริมาณ 100 กรัม สามารถนำมาทำเป็นเห็ดไมตาเกะแห้งได้ ปริมาณ 7.3 กรัม จะมีไฟเบอร์ถึง 47.9 % โดยไฟเบอร์นี้เพียงพอต่อความต้องการของร่างกายที่จะช่วยให้ระบบการขับถ่ายของร่างกายเป็นปกติได้ ");
        db.insert(MUSHROOM_TABLE, null, mr);

        mr = new ContentValues();
        mr.put(COL_THAI, "เห็ดเยื่อไผ่ (เห็ดร่างแห)");
        mr.put(COL_SCIENCE, "Phallus indusiatus");
        mr.put(COL_IMAGE, "PhallusIndusiatus.jpg");
        mr.put(COL_TYPE, "eat");
        mr.put(COL_DETAIL,"ดอกเห็ดเมื่อยังอ่อนมีเปลือกหุ้มรูปไข่สีขาว ขาวอมชมพู หรือม่วงอ่อน เมื่อเจริญขึ้นจะปริแตกเห็นก้านและฐานดอกรูประฆัง สีขาวคงเหลือเปลือกหุ้มอยู่ที่โคน ปลายเป็นแป้นกลม ผิวฐานดอกแบ่งเป็นห้อง ๆ คล้ายรวงผึ้ง ใต้ฐานดอกมีเยื่อบาง ๆ คล้ายร่างแหแขวนกางห้อยลงมาคล้ายสุ่มรอบก้านดอก เห็ดร่างแหชนิดนี้มีร่างแหสีขาว ยาวประมาณ 3 ใน 4 ของก้านดอก -1- สารสำคัญในเยื่อไผ่ เยื่อไผ่มีสารสำคัญที่ช่วยทำให้ต่อต้านการอักเสบของร่างกาย ได้แก่สารอัลแลนโทอิน ซึ่งสามารถพบได้เหมือนกันในเมือกหอยทาก ซึ่งสารนี้จะช่วยลดการอักเสบ หรือความระคายเคืองในผิวหนัง ฟื้นฟูเซลล์ผิวที่ที่เสื่อมสภาพ และสร้างเซลล์ผิวใหม่ให้มีความแข็งแรง");
        db.insert(MUSHROOM_TABLE, null, mr);

        mr = new ContentValues();
        mr.put(COL_THAI, "เห็ดระโงกแดงอมส้ม");
        mr.put(COL_SCIENCE, "Amanita caesarea");
        mr.put(COL_IMAGE, "AmanitaCaesarea.jpg");
        mr.put(COL_TYPE, "eat");
        mr.put(COL_DETAIL,"ดอกเห็ดอ่อนมีเยื่อหุ้มหนา รูปไข่ สีขาว เมื่อเจริญขึ้นผิวด้านบนปริแตกออกเป็นรูปถ้วยติดอยู่ที๋โคนก้าน หมวกเห็ดเป็นรูปไข่ สีแดงหรือแดงอมส้ม เมื่อบานกางออกเป็นรูปกระทะคว่ำแล้วแบนราบ ผิวเป็นมันขอบเป็นริ้วโดยรอบ ครีบสีเหลืองอ่อน ไม่ยึดติดกับก้าน ก้านสีเหลืองอ่อน ยาง 7-20 เซนติเมตร ผิวเรียบหรือมีเกล็ดเล็ก ๆ สีเหลืองอ่อน ภายในสีขาว มีรูกลวงวงแหวนเป็นแผ่นบางสีเหลืองห้อยลงมารอบก้านตอนบน ");
        db.insert(MUSHROOM_TABLE, null, mr);

        mr = new ContentValues();
        mr.put(COL_THAI, "เห็ดระโงกหิน");
        mr.put(COL_SCIENCE, "Amanita phalloides");
        mr.put(COL_IMAGE, "AmanitaPhalloides.jpg");
        mr.put(COL_TYPE, "poisonous");
        mr.put(COL_DETAIL,"ยังไม่ได้ใส่ข้อมูล");
        db.insert(MUSHROOM_TABLE, null, mr);

        mr = new ContentValues();
        mr.put(COL_THAI, "เห็ดระโงกหิน");
        mr.put(COL_SCIENCE, "Amanita virosa");
        mr.put(COL_IMAGE, "AmanitaVirosa.jpg");
        mr.put(COL_TYPE, "poisonous");
        mr.put(COL_DETAIL,"ดอกเห็ดอ่อนมีเหยื่อหุ้มหนา รูปไข่ สีขาว เมื่อเจริญขึ้นผิวด้านบนปริแตกออกเป็นรูปถ้วยติดอยู่ที่โคนก้าน หมวกเห็ดรูปกระทะคว่ำ สีขาว ครีบสีขาว ไม่ยึดติดกับก้าน ก้านสีขาว โคนโป่งเป็นกระเปาะ -1- เห็ดระโงกหิน  เมื่อรับประทานเข้าไปจะมีอาการเป็น 3 ระยะ คือ ระยะที่ 1 เป็นระยะฟักตัวประมาณ 6-24 ชั่วโมง ปกติประมาณ 10 ชั่วโมง หลังจากรับประทานเห็ดเข้าไปถึงจะแสดงอาการ ระยะที่ 2 จะมีอาการเป็นตะคริวที่ท้องคลื่นเหียนอาเจียน ท้องร่วง เอนไซม์ตับสูงขึ้นเรื่อย ๆ โดยจะแสดงอาการ 2-3 วัน ระยะที่ 3 มีอาการตับอักเสบ ไตวาย หัวใจวาย เลือดเป็นลิ่มแพร่กระจาย ชัก และเสียชีวิต ภายใน 6 –16 วัน ปกติ ประมาณ 8 วัน หลังจากการรับประทานเห็ดพิษชนิดนี้เข้าไป");
        db.insert(MUSHROOM_TABLE, null, mr);

        mr = new ContentValues();
        mr.put(COL_THAI, "เห็ดร่างแหกระโปรงยาวสีเหลือง");
        mr.put(COL_SCIENCE, "Dictyophora indusiata");
        mr.put(COL_IMAGE, "DictyophoraIndusiata.jpg");
        mr.put(COL_TYPE, "poisonous");
        mr.put(COL_DETAIL,"ดอกเห็ดเมื่อยังอ่อนมีเปลือกหุ้มรูปไข่สีขาว ขาวอมชมพู หรือม่วงอ่อน เมื่อเจริญขึ้นจะปริแตกเห็นก้านและฐานดอกรูประฆัง สีขาวคงเหลือเปลือกหุ้มอยู่ที่โคน ปลายเป็นแป้นกลม ผิวฐานดอกแบ่งเป็นห้อง ๆ คล้ายรวงผึ้ง ใต้ฐานดอกมีเยื่อบาง ๆ คล้ายร่างแหแขวนกางห้อยลงมาคล้ายสุ่มรอบก้านดอก เห็ดร่างแหชนิดนี้มีร่างแหสีส้ม ยาวประมาณ 3 ใน 4 ของก้านดอก ");
        db.insert(MUSHROOM_TABLE, null, mr);

        mr = new ContentValues();
        mr.put(COL_THAI, "เห็ดร่างแหสั้นขาว");
        mr.put(COL_SCIENCE, "Dictyophora duplicata");
        mr.put(COL_IMAGE, "DictyophoraDuplicata.jpg");
        mr.put(COL_TYPE, "eat");
        mr.put(COL_DETAIL,"ดอกเห็ดเมื่อยังอ่อนมีเปลือกหุ้มรูปไข่สีขาว ขาวอมชมพู หรือม่วงอ่อน เมื่อเจริญขึ้นจะปริแตกเห็นก้านและฐานดอกรูประฆัง สีขาวคงเหลือเปลือกหุ้มอยู่ที่โคน ปลายเป็นแป้นกลม ผิวฐานดอกแบ่งเป็นห้อง ๆ คล้ายรวงผึ้ง ใต้ฐานดอกมีเยื่อบาง ๆ คล้ายร่างแหแขวนกางห้อยลงมาคล้ายสุ่มรอบก้านดอก เห็ดร่างแหชนิดนี้มีร่างแหสีขาว ยาวประมาณ 1 ใน 3 ของก้านดอก");
        db.insert(MUSHROOM_TABLE, null, mr);

        mr = new ContentValues();
        mr.put(COL_THAI, "เห็ดรูประฆัง");
        mr.put(COL_SCIENCE, "Coprinus atramentarius");
        mr.put(COL_IMAGE, "CoprinusAtramentarius.jpg");
        mr.put(COL_TYPE, "poisonous");
        mr.put(COL_DETAIL,"หมวกเห็ดมีเนื้อหนากว่าเห็ดถั่วชนิดอื่น ขอบหมวกสีเทาดำเมื่อเริ่มมีดอกแก่และมักจะฉีกขาดเป็นแห่งๆ ครีบมีสีขาวและเปลี่ยนเป็นสีดำและย่อยตัวเองเป็นของเหลวสีดำ ครีบไม่ติดก้าน ก้านรูปทรงกระบอก ยาว 5-11 เซนติเมตร เส้นผ่าศูนย์กลาง 3-4 มิลลิเมตร สีขาวนวลหรือสีน้ำตาลอ่อน เส้นผ่าศูนย์กลาง 2-4 เซนติเมตร -1- ชอบขึ้นบนอินทรียวัตถุ เช่น กองเปลือกถั่วเหลืองเกิดดอกเป็นกลุ่มใหญ่เพื่อความปลอดภัยห้ามดื่มเครื่องคื่มที่มีแอลกอฮอลล์ หลังรับประทานเห็ด เพราะสารพิษทำให้มึนเมาจนหมดสติได้ แต่จะหายใจเป็นปกติภายใน 3-4 ชั่วโมง");
        db.insert(MUSHROOM_TABLE, null, mr);

        mr = new ContentValues();
        mr.put(COL_THAI, "เห็ดลม");
        mr.put(COL_SCIENCE, "Lentinus polychrous");
        mr.put(COL_IMAGE, "LentinusPolychrous.jpg");
        mr.put(COL_TYPE, "eat");
        mr.put(COL_DETAIL,"หมวกเห็ดรูปกรวยลึก สีขาวนวลหรือน้ำตาลอ่อนอมเทา ผิวเหนียวคล้ายหนัง ขอบงอลงเล็กน้อย ผิวมีขนสั้น ๆ สีน้ำตาลซึ่งรวมกันคล้ายเกล็ดเล็ก ๆ และปลายงอนขึ้นเล็กน้อย เกล็ดเรียงกระจายออกไปยังขอบหมวก ดอกอ่อนมีขอบบางและม้วนงอลง ครีบสีน้ำตาลอ่อนอมเทา บางและแคบ เมื่อแห้งจะเหนียวแข็งและเปลี่ยนเป็นสีน้ำตาลแดง หรือน้ำตาลอมม่วง ครีบมีความยาวต่างกัน ด้านในยาวขนานเล็กลงไปติดก้าน ด้านนอกเรียวแคบไปติดขอบหมวก ขอบครีบจักฟันเลื่อยเล็ก ๆ มองไม่เห็นด้วยตาเปล่า เวลาลูบจะสากมือ ก้านแข็งเหนียว สีขาวนวลแล้วเปลี่ยนเข้มขึ้นจนเป็นสีน้ำตาลดำ -1- คุณค่าทางโภชนาการของเห็ดลม คือ ช่วยบำรุงร่างกายให้แข็งแรง และสร้างเสริมภูมิคุ้มกันในร่างกายให้ทำงานอย่างมีประสิทธิภาพ ใช้เป็นยาบำรุงกำลัง ให้มีเรี่ยวแรงและพละกำลังได้เป็นอย่างดี ช่วยแก้อาการไข้ ทำให้ร่างกายกระปรี้กระเปร่า ไม่อ่อนเพลีย ช่วยป้องกันโรคเสื่อมสมรรถภาพทางเพศ อีกทั้งช่วยลดระดับน้ำตาลในเลือด ป้องกันอันตรายจากโรคเบาหวาน ช่วยยืดอายุของผู้ป่วยที่ติดเชื้อเอดส์ หรือ HIV ได้และ ช่วยปรับความสมดุลภายในร่างกายให้ทำงานได้ประสานกันอย่างมีประสิทธิภาพ");
        db.insert(MUSHROOM_TABLE, null, mr);


        // FN
        mr = new ContentValues();
        mr.put(COL_THAI, "เห็ดสมองวัว");
        mr.put(COL_SCIENCE, "Gyromitra esculenta");
        mr.put(COL_IMAGE, "GyromitraEsculenta.jpg");
        mr.put(COL_TYPE, "poisonous");
        mr.put(COL_DETAIL,"หมวกเห็ดรูปอานม้า สีน้ำตาลอมเหลืองแล้วเปลี่ยนเป็นน้ำตาลเข้ม เป็นลอนและคลื่นคล้ายสมอง ด้านล่างเป็นแอ่งเล็ก ๆ ตื้น ๆ สีน้ำตาลอ่อน ก้านสีขาว ยาวประมาณ 2-5 เซนติเมตร ไม่แตกแขนง บางดอกมีร่องยาว -1- เห็ดสมองวัวมีสารพิษ Monomethylhydrazine ที่อันตรายถึงชีวิตหากรับประทานเห็ดดิบ หรือน้ำต้มเห็ด ซึ่งสารพิษชนิดนี้เป็นพิษต่อระบบทางเดินอาหาร ระบบประสาทส่วนกลาง และทำลายเซลล์ตับ -2- เมื่อได้รับพิษ ผู้ป่วยจะมีอาการอาเจียน ถ่ายท้อง หลังจากกินเห็ดชนิดนี้มาแล้วหลายชั่วโมง ตามด้วยอาการเวียนศีรษะ ง่วงซึมและปวดศีรษะ หลายรายมีอาการกระสับกระส่าย จนอาการทรุดหนักเละเสียชีวิตภายใน 5-7 วัน -3- เห็ดสมองวัวเป็นเห็ดมีพิษ แต่สามารถรับประทานได้ หากกำจัดพิษโดยการนำเห็ดมาตากแห้งแล้วนำมาต้ม หรือต้มดอกเห็ดสด ๆ ก็ได้  สำหรับเห็ดสดให้หั่นเป็นชิ้นเล็กๆ ต้มให้เดือดประมาณ 5 นาทีแล้วเทน้ำออก การต้มแต่ละครั้งจะช่วยลดสารพิษได้ 10 เท่า ซึ่งให้เปลี่ยนน้ำใหม่ในการต้มแต่ละครั้ง การตากแดดจะสามารถลดสารพิษได้ โดยตากแดด 10 วันสารพิษ Gyromitrin จะลดลงไป 90 เปอร์เซ็นต์ อย่างไรก็ตามสารพิษก็ยังคงเหลืออยู่หลังจากการต้มไปแล้ว");
        db.insert(MUSHROOM_TABLE, null, mr);

        mr = new ContentValues();
        mr.put(COL_THAI, "เห็ดหนอนขาว");
        mr.put(COL_SCIENCE, "Clavaria fragilis");
        mr.put(COL_IMAGE, "ClavariaFragilis.jpg");
        mr.put(COL_TYPE, "eat");
        mr.put(COL_DETAIL,"ดอกเห็ดรูปใบหอกหรือทรงกระบอก สีขาว ยาวประมาณ 5-10 เซนติเมตร มักโค้งงอคล้ายตัวหนอน บางดอกปลายเป็นแขนงคล้ายรูปส้อม ภายในกลวง เนื้อในเห็ดสีขาว ก้านสีขาว รูปร่างเหมือนดอกจึงแยกไม่ออกว่าส่วนไหนเป็นก้าน");
        db.insert(MUSHROOM_TABLE, null, mr);

        mr = new ContentValues();
        mr.put(COL_THAI, "เห็ดหล่มกระเขียว");
        mr.put(COL_SCIENCE, "Russula virescens");
        mr.put(COL_IMAGE, "RussulaVirescens.jpg");
        mr.put(COL_TYPE, "eat");
        mr.put(COL_DETAIL,"หมวกเห็ดมีสีเขียวหม่นอมน้ำตาลอ่อน รูปทรงกลมเมื่อดอกอ่อน หากบานแล้วขอบจะโค้งงอลง ตรงกลางเว้าตื้น ผิวปริแตกเป็นเกล็ดสี่เหลี่ยมเผยให้เห็นเนื้อในสีขาว ครีบสีขาวหรือขาวนวล ยึดติดกับก้าน ก้านสีขาวหรือขาวนวล ยาวประมาณ 3-5 เซนติเมตร โคนเรียวเล็กกว่าตอนบนเล็กน้อย ");
        db.insert(MUSHROOM_TABLE, null, mr);

        mr = new ContentValues();
        mr.put(COL_THAI, "เห็ดหล่มขาว");
        mr.put(COL_SCIENCE, "Russula delica");
        mr.put(COL_IMAGE, "RussulaDelica.jpg");
        mr.put(COL_TYPE, "eat");
        mr.put(COL_DETAIL,"หมวกเห็ดรูปกระทะคว่ำ สีขาวนวลหรือน้ำตาลอ่อน กลางหมวกเป็นแอ่ง เมื่อเป็นดอกอ่อนขอบม้วนงอลง ผิวเรียบ ครีบสีขาวหรือขาวนวล ก้านสีขาวยาว 2.5-6 เซนติเมตร ดอกเห็ดบางแห่งมีสีน้ำตาลปน  เห็ดหล่มขาวมีแหล่งกระจายพันธุ์ในประเทศไทยทางภาคเหนือ ขึ้นเป็นดอกเดี่ยวหรือเป็นกลุ่ม 2-3 ดอก ตามป่าสนและป่าเบญจพรรณ -1- เห็ดหล่มขาวกินได้ แต่ไม่นิยม เพราะทำให้สุกแล้วมีรสไม่ดี");
        db.insert(MUSHROOM_TABLE, null, mr);

        mr = new ContentValues();
        mr.put(COL_THAI, "เห็ดหล่มเหลือง");
        mr.put(COL_SCIENCE, "Russula flavida");
        mr.put(COL_IMAGE, "RussulaFlavida.jpg");
        mr.put(COL_TYPE, "eat");
        mr.put(COL_DETAIL,"หมวกลักษณะนูน เรียบ สีเหลืองสด กลางหมวกมีแอ่งเล็กน้อย สีเหลืองทอง  มีเส้นผ่าศูนย์กลางขนาด 3-8 เซนติเมตร ครีบ ก้านกว้าง เรียงถี่ ติดกับก้านทรงกระบอก เรียบสีส้มในส่วนบนและส่วนล่างมีสีเหลือง โดยยาวประมาณ3-8 เซนติเมตร   ");
        db.insert(MUSHROOM_TABLE, null, mr);

        mr = new ContentValues();
        mr.put(COL_THAI, "เห็ดหลินจือ");
        mr.put(COL_SCIENCE, "Ganoderma lucidum");
        mr.put(COL_IMAGE, "GanodermaIucidum.jpg");
        mr.put(COL_TYPE, "eat");
        mr.put(COL_DETAIL,"ดอกเห็ดรูปไตหรือรูปครึ่งวงกลม ดอกอ่อนมีขอบสีขาว ถัดเข้าไปมีสีเหลืองอ่อน กลางดอกสีน้ำตาลหรือน้ำตาลแดง ดอกแก่เป็นสีน้ำตาลหรือน้ำตาลแดง ผิวเป็นมันเงา มีรอยจีบย่นหรือหยักเป็นคลื่น ขอบหมวกงุ้มลงเล็กน้อย ด้านล่างของหมวกเป็นรูกลมเล็ก ๆ เชื่อมติดกัน ปากรูสีขาวนวล เหลืองอ่อน หรือเหลืองอมเขียว ก้านสั้นหรือไม่มีก้าน แบบมีก้าน ก้านจะมีสีน้ำตาลเข้มหรือน้ำตาลดำ ยาวประมาณ 2-10 เซนติเมตร อยู่เยื้องไปข้างใดข้างหนึ่งหรือติดขอบหมวก ทำให้ดอกมีรูปคล้ายไตผิวก้านเป็นมันเงา -1- เห็ดหลินจือ  เป็นเห็ดหมื่นปี ถือเป็นยาจีนอันทรงคุณค่ามาตั้งแต่สมัยจักรพรรดิฉินซีฮ่องเต้ มีหลากหลายสายพันธุ์ แต่สรรพคุณเหมือนกัน เว้นแต่จะต่างกันที่พันธุ์ไหนมีสารบำรุงร่างกายมากหรือน้อย สารที่ว่านี้คือ สารพอลิแซ็กคาไรด์ (polysaccharide) สารนี้มีดีที่ช่วยสร้างภูมิคุ้มกันให้แก่ร่างกาย และต้านเซลล์มะเร็งได้ ซึ่งในเห็ดหลินจือพันธุ์สีแดงมีมากที่สุด -2- ในเห็ดหลินจือพบสารโพลีแซคคาไรด์มากกว่า 200 ชนิด เป็นสารที่ช่วยฟื้นฟูสุขภาพร่างกาย ต่อต้านเซลล์มะเร็ง สร้างสมดุลระดับน้ำตาลในเลือดและบำรุงไต มีคุณสมบัติช่วยบำรุงร่างกาย ช่วยขจัดสารพิษ ต่อต้านมะเร็ง เพื่อออกซิเจนในเลือด ทำให้เลือดไหลเวียนได้ดี กระตุ้นภูมิคุ้มกันของร่างกาย พบมากในดอกและราก -3- เห็ดหลินจือช่วยชะลอวัย และเสริมสร้างภูมิคุ้มกันร่างกาย ช่วยบำรุงสมอง ทำให้ความจำดี ช่วยควบคุมระดับน้ำตาลในเลือด เป็นยารักษาโรคเบาหวาน ช่วยรักษาลำไส้ แก้อาหารเป็นพิษ และเห็ดหลินจือเป็นยาถอนพิษ ขับเหงื่อ ขับปัสสาวะ และยับยั้งเชื้อแบคทีเรียเข้าสู่ร่างกาย ป้องกันเชื้อไวรัส งูสวัด อีสุกอีใส และเอดส์");
        db.insert(MUSHROOM_TABLE, null, mr);

        mr = new ContentValues();
        mr.put(COL_THAI, "เห็ดหอม");
        mr.put(COL_SCIENCE, "Lentinula edodes");
        mr.put(COL_IMAGE, "LentinulaEdodes.jpg");
        mr.put(COL_TYPE, "eat");
        mr.put(COL_DETAIL,"หมวกเห็ดรูปกระทะคว่ำ สีน้ำตาลไหม้ น้ำตาลแดง น้ำตาลอ่อนหรือน้ำตาลอ่อนอมเหลือง ผิวมีขนรวมกันเป็นเกล็ดหยาบ ๆ สีขาวนวลหรือน้ำตาลอ่อนกระจายทั่วไป ซึ่งจะแห้งหรือหลุดหายไปคงเหลือให้เห็นบางส่วนโดยเฉพาะตามขอบ สีขาว เรียงกันถี่และยึดติดกับก้าน ก้านสีน้ำตาลอ่อน มีขนหยาบ ก้านมักโค้งงอเพราะเจริญออกมาจากขอนไม้ -1- เห็ดหอมในภาษาจีนเรียกว่า “เฮียงคุ่ง” ตามตำราแพทย์แผนจีนโบราณถือว่าเห็ดหอมเป็นอาหารที่ใช้บำรุงร่างกาย เป็นของดีที่เอาไว้ใช้สำหรับปรุงอาหารในราชวงศ์ ช่วยให้เลือดลมดี และในงานวิจัยของประเทศญี่ปุ่นยังพบว่าเห็ดหอมมีสารเลนติเนน (Lentinan) ที่สามารถกระตุ้นการทำงานของระบบภูมิคุ้มกันในร่างกายให้มีประสิทธิภาพในการยับยั้งการเจริญเติบโตของเซลล์เนื้อร้ายต้นเหตุแห่งโรคมะเร็งได้ นอกจากนี้ในเห็ดหอมยังมีสารเออร์โกสเตอรอล (Ergosterol) ที่ช่วยป้องกันรังสียูวีจากแสงอาทิตย์ได้ด้วย -2- เห็ดหอมมีสรรพคุณที่ช่วยป้องกันโรคโลหิตจาง ช่วยแก้หวัดได้ เนื่องจากมีสรรพคุณต้านเชื้อไวรัส ช่วยลดความดันโลหิตสูง และโรคหลอดเลือดหัวใจตีบ เป็นยาบำรุงหัวใจ เห็ดหอมมีสารที่ช่วยบำรุงสมอง เป็นยาบำรุงประสาท ช่วยให้ความจำดี -3- เห็ดหอมมีวิตามินบี 2 ช่วยป้องกันโรคปากนกกระจอกและช่วยให้ผิวหนังไม่แห้งตึง สารต้านอนุมูลอิสระ ช่วยยับยั้งโรคมะเร็ง และช่วยชะลอวัย ช่วยปกป้องผิวจากแสงอาทิตย์ และช่วยให้ผิวดูมีน้ำมีนวล อีกทั้งประโยชน์ของเห็ดหอมยังช่วยให้นอนหลับสบาย");
        db.insert(MUSHROOM_TABLE, null, mr);

        mr = new ContentValues();
        mr.put(COL_THAI, "เห็ดหัวกรวดครีบเขียว");
        mr.put(COL_SCIENCE, "Chlorophyllum molybdites");
        mr.put(COL_IMAGE, "ChlorophyllumMolybdites.jpg");
        mr.put(COL_TYPE, "poisonous");
        mr.put(COL_DETAIL,"ดอกเห็ดอ่อนเป็นก้อนกลมแล้วบานออกเป็นรูปร่ม หมวกเห็ดสีขาว กลางหมวกมีสีน้ำตาล ซึ่งแตกออกเป็นเกล็ดใหญ่รูปสี่เหลี่ยม กระจายออกไปถึงกึ่งกลางหมวก ครียสีขาวค่อย ๆ เปลี่ยนเป็นสีขาวอมเขียวอ่อนก่อนจะเปลี่ยนเป็นสีน้ำตาลอมเขียวหม่น ยามดอกโรยจะเป็นสีเทาอมเขียวหม่น ครีปไม่ยึดติดกับก้าน ก้านยาว 6-20 เซนติเมตร รูปทรงกระบอก สีขาวหรือสีน้ำตาลอ่อน โคนก้านใหญ่เป็นกระเปาะเล็กน้อย ใต้หมวกมีวงแหวนใหญ้และหนา -1- เห็ดหัวกรวดครีบเขียวมีสารพิษกลุ่ม Gastrointestinal Irritants เป็นเห็ดพิษที่ทําให้เกิดอาการเฉพาะ ระบบทางเดินอาหารภายใน 30 นาที ถึง 3 ชั่วโมง มีอาการจุกเสียดยอดอก อ่อนเพลีย คลื่นไส้ อาเจียน ท้องเสีย และไม่ทําให้มีอาการทางระบบอื่น ๆ ");
        db.insert(MUSHROOM_TABLE, null, mr);

        mr = new ContentValues();
        mr.put(COL_THAI, "เห็ดตับเต่า");
        mr.put(COL_SCIENCE, "Phlebopus marginatus");
        mr.put(COL_IMAGE, "PhlebopusMarginatus.jpg");
        mr.put(COL_TYPE, "eat");
        mr.put(COL_DETAIL,"เห็ดตับเต่าดำ เป็นเห็ดที่มีผิวดอกด้านนอกสีดำหรือน้ำตาลอมดำ และมีขนละเอียดสีเทาดำปกคลุมผิวดอก ส่วนแผ่นสปอร์ด้านในมีสีเหลืองเข้ม ขอบดอกเห็ดบาง และอ่อนนุ่มคล้ายฟองน้ำ เนื้อเห็ดหนา ด้านล่างมีรูเป็นเหลี่ยมเกือบกลม สีเหลืองแล้วเปลี่ยนเป็นสีน้ำตาลเข้ม ก้านดอกเห็ดมีรูกลวงตรงกลาง โคนดอกเห็ดอวบใหญ่ สีดำอมน้ำตาล ยาว 8-15 เซนติเมตร ส่วนขนาดอกเห็ดกว้าง 3-8 เซนติเมตร ส่วนสปอร์มีรูปทรงกลมถึงรี สีน้ำตาลอ่อนอมชมพู ขนาดสปอร์ 4-4.5 x 8-10 ไมโครเมตร -1- เห็ดตับเต่า (King bolete mushroom) จัดเป็นเห็ดขนาดใหญ่ที่พบได้ในทุกภาค และนิยมนำมารับประทาน เนื่องจาก ดอกเห็ดมีขนาดใหญ่ เนื้อเห็ดมีความนุ่ม และลื่น ใช้ทำอาหารได้ทั้งดอกเห็ดอ่อน และดอกเห็ดแก่ เพราะถึงแม้ดอกเห็ดจะแก่ แต่ยังให้เนื้อเห็ดที่นุ่มลื่นเหมือนดอกเห็ดอ่อน");
        db.insert(MUSHROOM_TABLE, null, mr);

        mr = new ContentValues();
        mr.put(COL_THAI, "เห็ดหูช้าง");
        mr.put(COL_SCIENCE, "Ganoderma applanatum");
        mr.put(COL_IMAGE, "GanodermaApplanatum.jpg");
        mr.put(COL_TYPE, "eat");
        mr.put(COL_DETAIL,"ดอกเห็ดเป็นแผ่นรูปครึ่งวงกลม กว้าง 3-12 เซนติเมตร ด้านบนมีสีน้ำตาลหม่น ขรุขระ ย่นและเป็นร่องวงกลมช้อนกันห่างๆ เนื้อในเห็ดสีน้ำตาลเข้มหรือน้ำตาลอมชมพู เมื่อแห้งจะเหนียวและแข็งคล้ายไม้ ด้านล่างเป็นรูกลมเล็กๆ เชื่อมติดกัน รูสีน้ำตาล ปากรูสีขาวนวล เมื่อช้ำเปลี่ยนเป็นสีน้ำตาล ไม่มีก้าน ");
        db.insert(MUSHROOM_TABLE, null, mr);

        mr = new ContentValues();
        mr.put(COL_THAI, "เห็ดหูหนูขาว");
        mr.put(COL_SCIENCE, "Tremella fuciformis");
        mr.put(COL_IMAGE, "TremellaFuciformis.jpg");
        mr.put(COL_TYPE, "eat");
        mr.put(COL_DETAIL,"ดอกเห็ดคล้ายแผ่นวุ้นบางสีขาว รูปกลีบดอกไม้ ขอบเว้าและหยักเป็นคลื่น เมื่อดอกแห้งเปลี่ยนเป็นสีขาวอมเหลืองก่อน ก้านสั้นมาก -1- ประโยชน์โดยรวมของเห็ดหูหนูทั้งขาวและดำ คือช่วยบำรุงเลือด ช่วยชะลอความเสื่อมถอยของเซลล์ในร่างกาย เสริมสร้างภูมิคุ้มกัน ช่วยลดความเสี่ยงในการเกิดโรคมะเร็ง เป็นยาบำรุงกำลัง บำรุงระบบย่อยอาหาร บำรุงสมอง โดยเฉพาะเห็ดหูหนูขาว ที่ได้รับการยกย่องว่าเป็นสุดยอดของเห็ดเพื่อสุขภาพอย่างแท้จริง -2- เห็ดหูหนูขาวมีสารต้านอนุมูลอิสระซึ่งสูงกว่าเบต้าแคโรทีนในผักสีส้มและเหลือง มีส่วนช่วยในการชะลอความเสื่อมของเซลล์ ช่วยเสริมสร้างภูมิคุ้มกันให้กับร่างกาย จึงเป็นสุดยอดเห็ดอีกชนิดที่มีความโดดเด่นในการช่วยลดความเสี่ยงในการเกิดโรคมะเร็ง นอกจากนี้ยังช่วยให้ระบบการไหลเวียนเลือดดี ลดความดัน ลดอาการหลอดเลือดหัวใจตีบและหลอดเลือดในสมองแตกได้ -3- การรับประทานเห็ดหูหนูขาว จึงเป็นทางเลือกนึงในการดูแลสุขภาพร่างกายแบบครบวงจร ทั้งบำรุงกำลัง บำรุงกระดูก ข้อต่อ บำรุงอวัยวะภายใน ช่วยควบคุมน้ำหนัก บำรุงผิวให้เต่งตึง ชุ่มน้ำ");
        db.insert(MUSHROOM_TABLE, null, mr);

        mr = new ContentValues();
        mr.put(COL_THAI, "เห็ดหูหนูดำ");
        mr.put(COL_SCIENCE, "Auricularia auricula-judae");
        mr.put(COL_IMAGE, "AuriculariaAuricula.JPG");
        mr.put(COL_TYPE, "eat");
        mr.put(COL_DETAIL,"ดอกเห็ดคล้ายแผ่นวุ้น สีน้ำตาลแดง รูปพัดไม่มีด้าม ผิวด้านล่างเรียบและหยักเป็นคลื่นเล็กน้อย ผิวด้านบนบนสีอ่อนกว่า มีขนสั้นละเอียด และมีรอยจีบย่นหยักเป็นแผ่นรัศมีออกไปจากโคนที่ยึดติดกับขอนไม้ -1- เห็ดหูหนูได้ชื่อว่าเป็นอาหารคาวของอาหารเจ และยังเป็นสุดยอดของเห็ด เพราะมีส่วนช่วยในการป้องกันการเกิดโรคฮิตต่าง ๆ ได้หลายโรค โดยชาวจีนนั้นถือว่าเห็ดหูหนูเป็นอายุวัฒนะ ส่วนในทางการแพทย์จีนถือว่าเห็ดหูหนูเป็นยาบำรุงเลือดและพลัง และเห็ดหูหนูมักถูกนำมาใช้เป็นอาหารสำหรับผู้ที่มีไขมันในเลือดสูง ความดันเลือดสูง หลอดเลือดแข็งตัว หลอดเลือดตีบ เลือดจาง อ่อนเพลีย วัณโรค หอบหืด ไอแห้ง ไอเป็นเลือด เจ็บคอ เป็นโรคร้อนใน เป็นนิ่วในถุงน้ำดี นิ่วในทางเดินกระเพาะปัสสาวะ นิ่วในไต อุจจาระเป็นเลือด อีกทั้งยังช่วยป้องกันมะเร็ง ต้านมะเร็ง และช่วยลดอาการแทรกซ้อนภายหลังจากการฉายรังสีได้อีกด้วย -2- เห็ดหูหนูเป็นอาหารที่เหมาะกับผู้สูงอายุหรือผู้ที่มีโรคหัวใจ เนื่องจากมีฤทธิ์ต้านการเกาะตัวของเกล็ดเลือด และมีคุณสมบัติในการลดไขมันในเลือด โดยมีสารอะดีโนซีนที่ช่วยลดความเข้มข้นของเลือด ช่วยป้องกันโรคหลอดเลือดอุดตัน จึงไม่ทำให้เกิดเป็นลิ่มเลือดไปอุดตันเส้นเลือดหัวใจ สมอง และอวัยวะอื่น ๆ นอกจากนี้เห็ดหูหนูยังมีประโยชน์ในการช่วยเสริมสร้างโลหิต ทำให้หัวใจแข็งแรง ช่วยบำรุงสายตา บำรุงตับ นอกจากนี้เห็ดหูหนูยังมีส่วนช่วยทำให้ร่างกายเกิดความกระฉับกระเฉง กระปรี้กระเปร่า ช่วยผ่อนคลายกล้ามเนื้อที่ตึงเครียดให้คลายตัว บำรุงผิวพรรณให้เปล่งปลั่งสดใส -3- ข้อควรระวัง : เห็ดหูหนูมีลักษณะทำให้เกิดความชุ่มชื้น ความเย็น ผู้ที่มีระบบการย่อยอาหารหรือมีภาวะของร่างกายค่อนข้างไปทางเย็นมาก ๆ ต้องมีอาหารหรือสมุนไพรอื่นที่มีคุณสมบัติร้อนประกอบด้วย และควรระมัดระวังไม่ควรกินมากในช่วงกลางคืน แต่ควรกินในช่วงเวลากลางวันจะเหมาะสมกว่า");
        db.insert(MUSHROOM_TABLE, null, mr);

        mr = new ContentValues();
        mr.put(COL_THAI, "เห็ดหูหนูรวงผึ้ง");
        mr.put(COL_SCIENCE, "Auricularia delicata");
        mr.put(COL_IMAGE, "AuriculariaDelicata.jpg");
        mr.put(COL_TYPE, "eat");
        mr.put(COL_DETAIL,"ดอกเห็ดรูปพัด สีน้ำตาลอ่อนอมเหลือง เมื่อเนื้อเยื่อบางใสโปร่งแสง เมื่อสดเป็นวุ้น ขอบงอลงเล็กน้อย เนื้อบาง นิ่ม ยืดหยุ่น ผิวด้านบนเรียบหรือย่นเล็กน้อย มีเมือกลื่น ผิวด้านล่างสีขาวนวล มีขนละเอียด และมีรอยจีบย่นหยักเป็นตาข่ายเหมือนรังผึ้ง ไม่มีก้านหรือถ้ามี ก้านก็สั้นมาก");
        db.insert(MUSHROOM_TABLE, null, mr);

        mr = new ContentValues();
        mr.put(COL_THAI, "เห็ดหูหนูลายเสือ");
        mr.put(COL_SCIENCE, "Auricularia mesenterica");
        mr.put(COL_IMAGE, "AuriculariaMesenterica.jpg");
        mr.put(COL_TYPE, "eat");
        mr.put(COL_DETAIL,"เป็นแผ่นกลม ผิวด้านบนมีขนปกคลุมเล็กน้อย มีแถบวงกลมน้ำตาลอ่อนสลับน้ำตาลอมเทาถึงครีม คล้ายเยลลี่แต่เหนียว ขอบสีอ่อนกว่าและเป็นลอน ด้านเจริญพันธุ์หยาบ หยักย่น ม่วงอมแดง เนื้อเป็นวุ้น เมื่อแห้งสีจะเข้มขึ้ยนเปลี่ยนไปเป็นสีม่วงสด แต่เมื่อได้รับความชื้นจะคนสภาพเดิม ");
        db.insert(MUSHROOM_TABLE, null, mr);

        mr = new ContentValues();
        mr.put(COL_THAI, "เห็ดออรินจิ");
        mr.put(COL_SCIENCE, "Pleurotus eryngii");
        mr.put(COL_IMAGE, "PleurotusEryngii.jpg");
        mr.put(COL_TYPE, "eat");
        mr.put(COL_DETAIL,"ดอกมีขนาดใหญ่สีนน้ำตาล หมวกตรงกลางจะค่อยข้างหนาแต่ขอบหมวกบาง มีก้านดอกขขนาดใหญ่สีขาว -1- สรรพคุณของเห็ดออรินจิ คือ ช่วยต้านมะเร็ง เนื่องจากคุณสมบัติของสารต้านอนุมูลอิสระในเห็ดออรินจิ ช่วยลดอาการปวดตามส่วนต่างๆ ของร่างกาย ช่วยลดน้ำตาลในเลือด เหมาะกับผู้ที่เป็นโรคเบาหวาน และผู้ที่ต้องการลดน้ำหนัก ช่วยปรับสมดุลของร่างกาย ให้ทุกส่วนต่างๆ ทำงานได้ดียิ่งขึ้น -2- เห็ดออรินจิช่วยลดความดันโลหิตสูง ปรับความดันให้อยู่ในระดับปกติ มีคุณค่าทางโภชนาการคล้ายเนื้อสัตว์ สามารถทานควบคู่ไปกับผักสลัด หรือทำอาหารโดยใส่เห็ดแทนเนื้อสัตว์ได้ ช่วยลดคอเลสเตอรอลในร่างกาย ก็เหมาะกับผู้ที่รักสุขภาพ และอยากลดน้ำหนัก อีกทั้งยังบำรุงโลหิต");
        db.insert(MUSHROOM_TABLE, null, mr);


    }


    @Override
    public void onUpgrade(SQLiteDatabase db, int oldVersion, int newVersion) {

    }


}
